/* Invalid BP Reading Component Alert Title */
"INVALID_BP_READING_COMPONENT_ALERT_TITLE" = "Invalid %@ Reading!";

/* OK button label */
"OK_BUTTON_LABEL" = "OK";

/* Systolic BP Reading Component Name */
"SYSTOLIC_COMPONENT_NAME" = "Systolic";

/* Diastolic BP Reading Component Name */
"DIASTOLIC_COMPONENT_NAME" = "Diastolic";

/* Pulse BP Reading Component Name */
"PULSE_COMPONENT_NAME" = "Pulse";

/* Weight Component Name */
"WEIGHT_COMPONENT_NAME" = "Weight";

/* Date Component Name */
"DATE_COMPONENT_NAME" = "Date";

/* Missing BP Reading Component Message */
"BP_READING_COMPONENT_MISSING" = "%@ is missing.";

/* Invalid BP Reading Component Message */
"BP_READING_COMPONENT_OUT_OF_RANGE" = "%@ Pressure Reading must be in the range %hi to %hi";

/* Invalid Pulse Reading Message */
"PULSE_READING_OUT_OF_RANGE" = "%@ Reading must be in the range %hi to %hi";

/* Generic reading out of range */
"RANGE_OF_READING" = "%@ reading must be in the range %hi to %hi";

/* Invalid Weight Message */
"WEIGHT_OUT_OF_RANGE" = "%@ must not be less than %hi";

/* Date component range description. */
"DATE_COMPONENT_RANGE" = "Date must contain valid date and time values";

/* Blood Pressure Readings List View Title */
"BP_READINGS_LIST_TITLE" = "Readings";

/* Blood Pressure Reading Table View Entry */
"BP_READING_LIST_ENTRY" = "%1$3hu / %2$3hu, Pulse %3$3hu";

"BP_READING_NOTES_PLACEHOLDER_TEXT" = "Notes";

"DOPEY" = "Dumb Error";

/* Export Data View Controller Title */
"EXPORT_DATA_CONTROLLER_TITLE" = "Export Data";

/* Reminder View Controller Title */
"REMINDER_CONTROLLER_TITLE" = "Reminders";

/* Blood Pressure Graph Controller Title */
"BP_GRAPH_CONTROLLER_TITLE" = "Pressure Chart";

/* Blood Pressure Graph Title */
"BP_GRAPH_TITLE" = "Blood Pressure Chart";

/* Blood Pressure Graph X Axis */
"BP_GRAPH_X_AXIS" = "Reading Dates";

/* Blood Pressure Graph Y Axis */
"BP_GRAPH_Y_AXIS" = "Pressure mmHg";

/* Reminder all day event format string */
"ALL_DAY_REMINDER_EVENT" = "All day %@";

/* Reminder event format string */
"REMINDER_EVENT_DATE_TIME" = "%1$@ for %2$@";

/* Multiple interval - multi-frequency recurrence such as Every 3 Days */
"MULTI-INTERVAL_MULTI-FREQUENCY_RECURRENCE" = "%1$d %2$@";

/* Multiple interval - multi-frequency recurrency such as Every n 'units' */
"MULTI-INTERVAL_SINGLE-FREQUENCY_RECURRENCE" = "%@";

/* Event is all day and reoccurs */
"ALL_DAY_RECUR_EVENT" = "All day starting from %1$@ and repeats every %2$@";

/* Event is all day and repeats until an end date. */
"ALL_DAY_RECUR_EVENT_UNTIL_END_DATE" = "All day starting from %1$@ and repeats every %2$@ until %3$@";

/* Event is all day and repeats until an end date. */
"ALL_DAY_RECUR_EVENT_UNTIL_OCCURENCES_REACHED" = "All day starting from %@ and repeats every %1$@ for %2$@";

/* Event that starts at a date and repeats at a given interval and freq. */
"RECUR_EVENT" = "Starts %1$@ for %2$@ and repeats every %3$@";

/* Event that starts at a date and repeats at a given interval and freq. until an end date */
"RECUR_EVENT_UNTIL_END_DATE" = "Starts %1$@ for %2$@ and repeats every %3$@ until %4$@";

/* Event that starts at a date and repeats at a given interval and freq. until an end date */
"RECUR_EVENT_UNTIL_OCCURENCES_REACHED" = "Starts %1$@ for %2$@ and repeats every %3$@ for %4$@";

/* Single Day */
"DAY" = "day";

/* Single Week */
"WEEK" = "week";

/* Single Month */
"MONTH" = "month";

/* Single Year */
"YEAR" = "year";

/* Multiple Days */
"DAYS" = "days";

/* Multiple Weeks */
"WEEKS" = "weeks";

/* Multiple months */
"MONTHS" = "months";

/* Multiple Years */
"YEARS" = "years";

/* Titles for the CSV Blood Pressure Log */
"CSV_DATE_FIELD_TITLE" = "Date";
"CSV_TIME_FIELD_TITLE" = "Time";
"CSV_PULSE_FIELD_TITLE" = "Pulse";
"CSV_SYSTOLIC_FIELD_TITLE" = "Systolic";
"CSV_DIASTOLIC_FIELD_TITLE" = "Diastolic";
"CSV_WEIGHT_FIELD_TITLE" = "Weight";
"CSV_NOTE_FIELD_TITLE" = "Note";

/* Blood Pressure Graph Failure Title */
"BPGRAPH_FAILURE_ALERT_TITLE" = "Blood Pressure Chart Graphing Failure";

/* Export Data User Error Title */
"EXPORT_DATA_USER_ERROR_TITLE" = "Export Blood Pressure Error";

/* Export Data Failure Title */
"EXPORT_DATA_FAILURE_ALERT_TITLE" = "Export Blood Pressure Data Failure";

/* Export Data Fetch Failure Title */
"EXPORT_DATA_FETCH_FAILURE_TITLE" = "Failure Fetching Blood Pressure Reading Data";

/* Export Data Failure Messages */
"EXPORT_DATA_USER_ERROR_INVALID_DATE_RANGE" = "Start date must be less than or equal to end date.";

"TEMPORARY_DIR_NAME_RETRIEVAL_FAILURE_MSG" = "Couldn't retrieve temporary directory name.";

"EXPORT_DATA_FETCH_FAILURE_MSG" = "An error occurred during the attempt to retrieve blood pressure reading data from the database.";

"EXPORT_DATA_DEVICE_CANNOT_SENDMAIL" = "The device is not configured to send mail. Please set up email capability and try again.";

"EXPORT_DATA_CANNOT_CREATE_COMPOSE_MAIL_VIEW" = "Failure creating mail composer view."; 

"EXPORT_DATA_COMPOSE_MAIL_VIEW_ERROR" = "Error composing mail.";

"EXPORT_DATA_MAIL_SUBJECT" = "Blood Pressure Exported Readings";

"EXPORT_DATA_MAIL_MESSAGE_BODY" = "The attached file contains Blood Pressure Readings for the date range %@ to %@";

"EXPORT_RANGE_AUTO_UPDATED" = "Export Range Modified";

"AUTO_UPDATED_END_DATE" = "The specified export range end date occurs prior to all blood pressures readings.  The export date range has been updated.";

"AUTO_UPDATED_START_DATE" = "The specified export range start date occurs after all blood pressure reading dates.  The export date range has been updated.";

/* Strings used in creating NSError objects for reminder store failures */
"DELETE_REMINDER_FROM_REMINDER_STORE_FAILURE_DESCRIPTION" = "Deletion of reminder event failed: %@";

"SAVE_REMINDER_TO_REMINDER_STORE_FAILURE_DESCRIPTION" = "Save reminder failed: %@";

"ADD_REMINDER_TO_REMINDER_STORE_FAILURE_DESCRIPTION" = "Add reminder failed: %@";

"REMINDER_STORE_FAILURE_RECOVERY_SUGGESTION" = "Application must terminate. All unsaved changes will be reverted. Please re-start application.";

"DELETE_EVENT_FROM_CALENDAR_STORE_FAILURE" = "Failure deleting event from calendar store.";

"DELETE_REMINDER_METADATA_FAILURE" = "Failure deleting reminder event metadata.";

"SAVE_REMINDER_TO_CALENDAR_STORE_FAILURE" = "Save to calendar event store failed.";

"SAVE_REMINDER_METADATA_FAILURE_REASON" = "Reminder event metadata save failed.";

"ADD_REMINDER_TO_CALENDAR_STORE_FAILURE" = "Adding to calendar event store failed.";

"ADD_REMINDER_METADATA_FAILURE_REASON" = "Reminder event metadata save failed.";

/* Reminder Store Failure Title */
"READING_REMINDER_FAILURE_TITLE" = "Reminder Event Error";

/* BP Graph Options Strings */
"BPGRAPH_OPTIONS_BUTTON" = "Options";

"BPGRAPH_LEGEND_BUTTON" = "Legend";

"BPGRAPH_OPTIONS_TITLE" = "Chart Options";

/* BP Reading Details Title */
"BPREADING_DETAIL_VC_TITLE" = "Reading Details";

/* New BP Reading Details Title */
"NEW_BPREADING_DETAIL_VC_TITLE" = "New Reading";

/* Data Import Error Strings. */
"IMPORT_READINGS_FAILURE_DESCRIPTION" = "Import blood pressure readings failed: %@";

"IMPORT_READINGS_DUPLICATE_DATES_FAILURE_REASON" = "Two or more readings with the date (%@) in data to import.";

"IMPORT_READINGS_DUPLICATE_DATES_DETECTED_REASON" = "Two or more readings in the import data have the same date.";

"IMPORT_READINGS_SAVE_READINGS_FAILURE_REASON" = "Couldn't save imported readings to the database.";

"IMPORT_READINGS_DUPLICATE_DATES_RECOVERY_SUGGESTION" = "Modify the import data to remove duplicate data entries.";

"IMPORT_READINGS_DUPLICATE_DATE_DETECTION_FAILURE_REASON" = "Failure encountered checking import data for duplicate data.";

"IMPORT_READINGS_RESTART_APPLICATION_RECOVERY_SUGGESTION" = "Try closing the application, restart the application, and try the import again.";

"IMPORT_READINGS_INVALID_IMPORT_FILENAME_REASON" = "Import filename is invalid.";

"IMPORT_READINGS_INVALID_DATABASE_CONTEXT_REASON" = "Failure creating database context";

"IMPORT_READINGS_TOO_MANY_COLUMNS_REASON" = "Line %u has at least %u columns which is more than the expected number.";

"IMPORT_READINGS_TOO_MANY_COLUMNS_RECOVERY_SUGGESTION" = "Make sure the import file contains only the following columns: Date, Time, Systolic, Diastolic, Pulse, Weight, and Notes";

"IMPORT_READINGS_INVALID_COLUMN_NAME_REASON" = "Import file contains an invalid column name (%@)";

"IMPORT_READINGS_INVALID_COLUMN_NAME_SUGGESTION" = "Import file should contain only the following column names: Date, Time, Systolic, Diastolic, Pulse, Weight, and Notes";

"IMPORT_READINGS_INVALID_READING_DATA_RECOVERY_SUGGESTION" = "Edit line %u to correct the reported errors and retry importing.";

"IMPORT_READINGS_DATE_TIME_STAMP_DATA_INVALID_REASON" = "Date and time data on line %u has invalid format.";

"IMPORT_READINGS_DATE_TIME_STAMP_DATA_INVALID_RECOVERY_SUGGESTION" = "Make sure that the date and time columns contain valid data.";

"IMPORT_READINGS_UNEXPECTED_ERROR_REASON" = "Unexpected error importing file on line %u.";

"IMPORT_READINGS_INVALID_DATA_IN_COLUMN_REASON" = "The data on line %u in col %u is for the %@ component and is expected to contain %@.";

"IMPORT_READINGS_INVALID_DATA_IN_COLUMN_RECOVERY_SUGGESTION" = "Please correct the data on the line %u and try the import again.";

"IMPORT_READINGS_INVALID_COLUMN_INTERNAL_REASON" = "The column for %@ coulnd't be located.";

"TEXT_TYPE" = "text";

"NUMERIC_TYPE" = "a whole number";

"DATE_TYPE" = "a date";

"UNKNOWN_TYPE" = "an unknown type(%u)";

"IMPORT_READINGS_ACTIVITY_ALERT_TITLE" = "Importing Readings";

"IMPORT_READING_ACTIVITY_ALERT_MSG_READING_IMPORTED" = "1 new reading imported.";

"IMPORT_READING_ACTIVITY_ALERT_MSG_READINGS_IMPORTED" = "%u new readings imported.";

"IMPORT_READING_ACTIVITY_ALERT_MSG_READING_UPDATED" = "1 existing reading updated.";

"IMPORT_READING_ACTIVITY_ALERT_MSG_READINGS_UPDATED" = "%u existing readings updated.";

"IMPORT_READINGS_FAILURE_ALERT_TITLE" = "Import Failed";

"IMPORT_READINGS_FAILURE_MSG" = "An error occurred importing blood pressure readings.";

"IMPORT_READINGS_COMPLETE_TITLE" = "Import Complete";

"IMPORT_READINGS_CANCELED_MSG" = "Import blood pressure readings canceled before all readings were imported.";

"EXPORT_READINGS_SEND_TO_APP_TITLE_FAILURE" = "Send to Application";

"EXPORT_READINGS_SEND_TO_APP_NO_APPS_ON_DEVICE" = "There are no applications on the device that are compatible with the exported data.";

"CALENDAR_ACCESS_DENIED" = "Access to Calendar Information Disabled";

"ENABLE_CALENDAR_ACCESS" = "Access to calendar information is disabled. To use this feature enable it the Settings application under Privacy -> Calendars";



